{
  "7.0.3": {
    "en": "Fix next8Hrs selection. Fixed priceNow. Pricechart always includes 0 at y-axis. Stability improvements."
  },
  "7.0.2": {
    "en": "Fixed summarizer price updates. Fixed price markup 15m DAP. Stability improvements."
  },
  "7.0.1": {
    "en": "Fixed duplicate timestamps in ENTSO-E prices. DAP 60m driver now averages 15m prices."
  },
  "7.0.0": {
    "en": "DAP: Added driver for 15m. Pricecharts have black background. Removed fetch prices delay. Removed legacy migrations. homey-api@3.14.5"
  },
  "6.7.2": {
    "en": "Added support for Sessy app >=3.0. homey-api@3.11.3"
  },
  "6.7.1": {
    "en": "Xom headroom fix."
  },
  "6.7.0": {
    "en": "Appstore stable release."
  },
  "6.6.10": {
    "en": "Fix XOM flow distribution based on SOC"
  },
  "6.6.9": {
    "en": "Fix XOM flow distribution based on SOC"
  },
  "6.6.8": {
    "en": "Fix XOM flow when >2 batteries"
  },
  "6.6.7": {
    "en": "homey-api@3.11.1. XOM flow optimization"
  },
  "6.6.6": {
    "en": "homey-api@3.6.8"
  },
  "6.6.5": {
    "en": "DAP: Fix new ENTSO-E API. Fix EEX gas API. Fix LEBA gas API. Removed Nordpool API. Known issue: forecast not working."
  },
  "6.6.4": {
    "en": "DAP: Fix new ENTSO-E API. BAT: Added SolarEdge Growatt"
  },
  "6.6.3": {
    "en": "Added flow compare to monthly average. New ENTSO-E API implemented. Fix JSON example. homey-api@3.6.4"
  },
  "6.6.2": {
    "en": "Capability flows compatibility >=fw12.2.0. Fix settings timeout error."
  },
  "6.6.1": {
    "en": "Fixed ENTSO-E handler."
  },
  "6.6.0": {
    "en": "Fixed internal hourly trigger drift. Stability improvements. homey-api@3.6.3"
  },
  "6.5.3": {
    "en": "homey-api@3.6.0"
  },
  "6.5.2": {
    "en": "homey-api@3.5.2"
  },
  "6.5.1": {
    "en": "homey-api@3.5.0"
  },
  "6.5.0": {
    "en": "BAT: Added support for Blauhoff Afore and Blauhoff Deye. SUM: added flow card to change tariff_update_group. DAP: Added AND card price_highest_avg_before. Extende card selection price_lowest_in_next_known_hours to 20 hours. homey-api@3.4.33"
  },
  "6.4.1": {
    "en": "Updated German translation. homey-api@3.4.32"
  },
  "6.4.0": {
    "en": "DAP: Added new price hour trigger. DAP: Added UK Gas prices. Fixed EGSI and EOD Gas prices. homey-api@3.4.29"
  },
  "6.3.3": {
    "en": "DAP: Fixed gas prices better."
  },
  "6.3.2": {
    "en": "DAP: Fixed gas prices. homey-api@3.4.29"
  },
  "6.3.1": {
    "en": "DAP: Fixed avg price this month and last month."
  },
  "6.3.0": {
    "en": "DAP: Added avg price this month and last month. Variable markup of absolute price (DE). BAT: Added currency sign setting."
  },
  "6.2.2": {
    "en": "BAT: Improved SoC reporting in flow. German translation updated. homey-api@3.4.25"
  },
  "6.2.1": {
    "en": "DAP: forecast afternoon bug fixed. German translation updated. homey-api@3.4.20"
  },
  "6.2.0": {
    "en": "DAP: Fix exchange rate fluke. Added e-data source. Added e-price forecast. BAT: display forecast in graph."
  },
  "6.1.4": {
    "en": "BAT: keep charging/discharging when almost full/empty. DAP: Fix flowcard lowest average before. homey-api@3.4.18"
  },
  "6.1.3": {
    "en": "DAP: fixed flowcards for highest/lowest Before and highest/lowest Average. homey-api@3.4.13"
  },
  "6.1.2": {
    "en": "DAP: fixed flowcards for highest/lowest Before and highest/lowest Average. SUM: stability improvements. BAT: smart ROI tweaked for discharge value representing AC side. Max discharge default changed to 1700."
  },
  "6.1.1": {
    "en": "BAT: Improved XOM energy distribution over multiple batteries. XOM smoothing defaults changed. Max discharge default changed to 1550."
  },
  "6.1.0": {
    "en": "BAT: Added XOM flow trigger. Update XOM settings from flow. Sync smart ROI Graphic profit with flow. Default profit set to 0.08."
  },
  "6.0.4": {
    "en": "BAT: Removed smart ROI flows for HP2016/2019. Smart ROI trigger card will stop (dis)charging after duration expires. Cache smart ROI calculations."
  },
  "6.0.3": {
    "en": "BAT: Undeprecated old ROI flow card. New ROI flow cards and strategy graph made optional and EXPERIMENTAL. homey-api@3.4.10"
  },
  "6.0.2": {
    "en": "BAT: Added BAT strategy image. Remove double strat trigger on price update. Fetch prices after pair. Textual updates. SUM: next hours image labels start at current hour."
  },
  "6.0.1": {
    "en": "BAT: added support for Sonnen Batterie app. Added new ROI strategy trigger."
  },
  "6.0.0": {
    "en": "BAT: Completely new ROI strategy flow. Deprecated old ROI flow card. SUM: Fix paring new devices."
  },
  "5.9.3": {
    "en": "SUM: ignore unrealistic meter values. BAT: added energy value settings. DAP: added price ranking. homey-api@3.4.9"
  },
  "5.9.2": {
    "en": "German translation updated. homey-api@3.4.8"
  },
  "5.9.1": {
    "en": "Battery: Added support for SonnenBatterie. homey-api@3.4.2"
  },
  "5.9.0": {
    "en": "Added repairing to a new source device. homey-api@3.1.0"
  },
  "5.8.2": {
    "en": "Added flow card Avg price is lowest before. Reduced price fetching spread. Reduced app footprint."
  },
  "5.8.1": {
    "en": "Fixed PriceIs flowcards sorting function. Extended lowest/highest before period to 23 hrs max. homey-api@3.0.27."
  },
  "5.8.0": {
    "en": "Fixed Gas DAP. Fixed Gas summarizer for ZTATZ. homey-api@3.0.25."
  },
  "5.7.5": {
    "en": "homey-api@3.0.17."
  },
  "5.7.4": {
    "en": "Fixed adding new summarizer devices. Stability fixes."
  },
  "5.7.3": {
    "en": "Migrate to homey-api@3.0.15. Improved retry source devices. Stability fixes. Added support for Toshiba AC. Fixed daily use reset at midnight. Fixed pairing of IUNGO, Huawei Solar, ZTAZ P1 and Qubino."
  },
  "5.7.2": {
    "en": "Migrate to homey-api@3.0.12. Improved retry source devices. Stability fixes. Added support for Toshiba AC. Fixed daily use reset at midnight. Fixed pairing of IUNGO, Huawei Solar, ZTAZ P1 and Qubino."
  },
  "5.7.1": {
    "en": "Summarizer: Added support for Toshiba AC. Fixed daily use reset at midnight."
  },
  "5.7.0": {
    "en": "Migrate to homey-api@3.0.12. Improved retry source devices. Stability fixes."
  },
  "5.6.9": {
    "en": "DAP: Fix trigger flow for new prices. Added THEN flow card to get prices JSON."
  },
  "5.6.8": {
    "en": "DAP: Remove double hourly trigger for new price."
  },
  "5.6.7": {
    "en": "DAP: Fixed price fetching error handling."
  },
  "5.6.6": {
    "en": "Battery: Fixed support for Victron Energy Storage."
  },
  "5.6.5": {
    "en": "Battery: Added support for Victron Energy Storage. Improved hedge strategy."
  },
  "5.6.4": {
    "en": "DAP: fix new price info immediately available for image and capabiities. Added flowcard 'lowest price for all known next hours'."
  },
  "5.6.3": {
    "en": "DAP: fix new price info immediately available for flows. Use backup source if no prices for tomorrow. Extended onUninit crash prevention."
  },
  "5.6.2": {
    "en": "DAP: fix new price info immediately available for flows. Use backup source if no prices for tomorrow. Extended onUninit crash prevention."
  },
  "5.6.1": {
    "en": "DAP: added pricing graphs as images. Added future prices trigger flowcard. Battery: Improved hedge strategy."
  },
  "5.6.0": {
    "en": "DAP: added pricing graphs as images. Added future prices trigger flowcard. Battery: Improved hedge strategy."
  },
  "5.5.4": {
    "en": "DAP: Removed Enever as source. Battery: Improved hedge strategy. homey-api@1.10.21"
  },
  "5.5.3": {
    "en": "Battery: Improved hedge strategy."
  },
  "5.5.2": {
    "en": "Battery: Improved hedge strategy."
  },
  "5.5.1": {
    "en": "Battery: Added support for Solax Energy Storage. Improved hedge strategy."
  },
  "5.5.0": {
    "en": "Added new device type for Energy Storage Systems (Home Battery)."
  },
  "5.4.8": {
    "en": "DAP: Added flowcard price is one of highest/lowest coming hours."
  },
  "5.4.7": {
    "en": "Summarizer: Fix manual money settings"
  },
  "5.4.6": {
    "en": "Summarizer: Added kWh source support for Huawei solar and Iungo. Fix currency unit change. homey-api@1.10.20"
  },
  "5.4.5": {
    "en": "Fixed ENTSOE new API url. homey-api@1.10.18"
  },
  "5.4.4": {
    "en": "Fixed Summarizer that use Watt as source."
  },
  "5.4.3": {
    "en": "Fixed Virtual Summarizer settings. Fixed adding new Homey Energy devices."
  },
  "5.4.2": {
    "en": "Fixed DAP Time Of Day markup settings."
  },
  "5.4.1": {
    "en": "Fixed adding new Summarizer. Fixed gas/water Summarizer settings. homey-api@1.10.15"
  },
  "5.4.0": {
    "en": "DAP: Add multiple markups on a configurable Time Of Day."
  },
  "5.3.4": {
    "en": "Summarizer: Fixed unit migration for Gas. update homey-api@1.10.12."
  },
  "5.3.3": {
    "en": "Summarizer: added weighted average price for this month/year, added support for ZTAZ P1, added custom budget distribution, fixed GAS updates for certain source devices, fixed migration, fixed custom budget. DAP: implemented workaround for EEX EOD source bug, reduced price fetch spreading delay to max 10 minutes. update homey-api@1.10.10."
  },
  "5.3.2": {
    "en": "Summarizer: added weighted average price for this month/year, added support for ZTAZ P1, added custom budget distribution, fixed GAS updates for certain source devices, fixed migration, fixed custom budget. DAP: implemented workaround for EEX EOD source bug, reduced price fetch spreading delay to max 10 minutes."
  },
  "5.3.1": {
    "en": "Summarizer: added weighted average price for this month/year, added support for ZTAZ P1, added custom budget distribution, fixed GAS updates for certain source devices, fixed migration, fixed custom budget. DAP: implemented workaround for EEX EOD source bug, reduced price fetch spreading delay to max 10 minutes."
  },
  "5.3.0": {
    "en": "Summarizer: added weighted average price for this month/year, added support for ZTAZ P1, added custom budget distribution, fixed GAS updates for certain source devices. DAP: implemented workaround for EEX EOD source bug, reduced price fetch spreading delay to max 10 minutes."
  },
  "5.2.0": {
    "en": "Added EEX EOD and EGSI gas biddingZones. EEX preferred over Enever as source for Gas DAP. Added device onUninit handling. update homey-api@1.10.7."
  },
  "5.1.4": {
    "en": "Fixed summarizer in polling mode being unavailable."
  },
  "5.1.3": {
    "en": "Added sourcecaps logging on incompatible meter_power error. Fixed incorrect 'use_measure_source' during power summarizer pair."
  },
  "5.1.2": {
    "en": "Added solar panel Summarizer budget distribution. German translation updated. README.md updated."
  },
  "5.1.1": {
    "en": "Improved source device detection during pair. Fixed enever Gas DAP source. Removed PowerNext as DAP Gas price source."
  },
  "5.1.0": {
    "en": "Fix for hourly poll of power summarizer devices."
  },
  "5.0.9": {
    "en": "Fix Summarizer migration after pair. Fix virtual_via_flow Summarizer Device pair."
  },
  "5.0.7": {
    "en": "Added Enever as DAP Gas source (TTF EGSI, TTF EOD). Increased timeout on easyenergy DAP Gas (TTF LEBA)"
  },
  "5.0.6": {
    "en": "Fixed source capability detection during pair. Added meter update queueing. Stability improvements."
  },
  "5.0.5": {
    "en": "Stability improvements."
  },
  "5.0.4": {
    "en": "Summarizer: fix migration from v4.x.x, fix linear budget distribution, added hourly poll delay setting for water, modified defaults for poll delay, add distribution on app migration. DAP: set deprecated gas device as unavailable, fix avg price this_day and next_8h."
  },
  "5.0.3": {
    "en": "DAP and summarizer: set device unavailable during capability migration, disable new device settings during migration. Summarizer: rearranged device order during pair, removed Homey itself from pairing list, disabled multiple selections during pair, apply budget distribution setting for main meter devices during summarizer pair, fixed hourly polling for Qubino 3-phase meter, added hourly poll delay,  use previous tariff on start of new hour."
  },
  "5.0.2": {
    "en": "Added settable yearly budget for Gas, Electricity and Water. Added linear usage distribution over the year. Added NL_2023 usage distribution (prijsplafond) for Gas and Electricity. Added % on/above/under the budget for Month-to-date and Year-to-date. Update to homey-api@1.10.5."
  },
  "5.0.1": {
    "en": "Added support for Qubino 3-phase meter. Round 'price now' tag to decimals settings. Rewrite summarizer driver to support more devices/apps. Make tariff group 1 default for new summarizer devices. Fix summarizer bugs for some source devices/apps. Fixed english title and-card. Fixed detect new tariffs received @midnight."
  },
  "5.0.0": {
    "en": "Complete rewrite of DAP driver. Added seperate DAP device for gas spot prices. Added all gas spot prices from PowerNext. Added multiple selections during summarizer pair. Fixed DST handling. Many fixes and code optimizations."
  },
  "4.9.1": {
    "en": "Show kWh and m3 of previous period. Show lowest/highest price/hour for the next 8H. Reordered capabilities for DAP E. Fix capability states after migration. Fix currency symbol migration."
  },
  "4.9.0": {
    "en": "Show kWh and m3 of previous period. Fix capability states after migration."
  },
  "4.8.3": {
    "en": "Fixed Watts As Souce ghost usage. Update to homey-api@1.10.3."
  },
  "4.8.2": {
    "en": "Fixed CZ DAP spot prices."
  },
  "4.8.1": {
    "en": "Fixed TTF EOD Gas price fetching. Removed support for DAP Daylight Savings Time change. Update to homey-api@1.9.1."
  },
  "4.8.0": {
    "en": "Added Homey Energy as source device."
  },
  "4.7.6": {
    "en": "Multiple fixes for DAP Daylight Savings Time change. Fix for multiple summarizers of same device. Update to homey-api@1.8.0"
  },
  "4.7.3": {
    "en": "Partial fix for DAP Daylight Savings Time change. Update to homey-api@1.8.0"
  },
  "4.7.2": {
    "en": "Added fixed costs per hour/day/month for summarizer."
  },
  "4.7.1": {
    "en": "Added tariff update groups."
  },
  "4.7.0": {
    "en": "Added ability to add same summarizer multiple times. Added maximum price and hour as capability. Added min/max/average price tomorrow as capability. Fix currency migration."
  },
  "4.6.2": {
    "en": "Added ability to add same summarizer multiple times. Added maximum price and hour as capability. Added average price tomorrow as capability."
  },
  "4.6.1": {
    "en": "Added flow cards for highest price. Changed several flow cards from dropdown to number."
  },
  "4.6.0": {
    "en": "Added Nordpool as backup source for DAP. Fixed bug in ENTSOE DAP Germany/Luxembourg. Fixed GB DAP. Removed DAP SE_Sweden_SvK"
  },
  "4.5.6": {
    "en": "DAP prices persistence on app restart. Fixed bug in Money prev. hour/day."
  },
  "4.5.5": {
    "en": "Improved fetching new prices and detection after day change. Improved DAP fetch randomization. Removed invalid DAP bidding areas."
  },
  "4.5.4": {
    "en": "Improved fetching new prices and detection after day change."
  },
  "4.5.3": {
    "en": "Added Insights for multiple capabilities. Added option to set kWh/m3 decimals. Improved new prices detection and debug logging. homey-api@1.7.5"
  },
  "4.5.2": {
    "en": "Fixed x% below/above flow card. Fixed WHEN flow card for New GAS Prices received."
  },
  "4.5.1": {
    "en": "Fixed currency setting for active tariff. Added AND cards. Added WHEN flow card for New Prices received."
  },
  "4.5.0": {
    "en": "Added Danish translation. Updated Dutch translation. homey-api@1.7.4"
  },
  "4.4.9": {
    "en": "Updated Norwegian translation."
  },
  "4.4.8": {
    "en": "Added French translation. Updated Italian translation."
  },
  "4.4.7": {
    "en": "Added translations for German, Italian, Norwegian and Swedish. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.6": {
    "en": "Added translations for German, Italian, Norwegian and Swedish. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.5": {
    "en": "Added translations for German, Swedish and Italian. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.4": {
    "en": "Added translations for German, Swedish and Italian"
  },
  "4.4.3": {
    "en": "Added DAP day/night markup (Grid cost in Norway). Fixed timezone offset for Estonia."
  },
  "4.4.2": {
    "en": "Added DAP day/night markup (Grid cost in Norway)."
  },
  "4.4.1": {
    "en": "Added automatic fetching of exchange rates. DAP markup is now in local currency. Fixed markup migration."
  },
  "4.4.0": {
    "en": "Added automatic fetching of exchange rates. Fixed DAP markup is now in local currency."
  },
  "4.3.7": {
    "en": "Fixed gas price fetching. Fix DAP send LEBA gas rate."
  },
  "4.3.6": {
    "en": "Set DAP markups and exchange rate via flow. Added DAP capabilities for hour of lowest price."
  },
  "4.3.5": {
    "en": "€ set as default currency for DAP. Configurable currency unit and decimals. homey-api@1.7.0"
  },
  "4.3.4": {
    "en": "Lowest price before time flow card extended to 12hrs. Added lowest number of hours this day. Update to homey-api@1.6.0"
  },
  "4.3.3": {
    "en": "Added highest price flow cards. Added lowest price before time flow card."
  },
  "4.3.2": {
    "en": "Removed insights DAP H1_7. Fixed Gas LEBA day-ahead prices timezone offset."
  },
  "4.3.0": {
    "en": "Added Gas LEBA day-ahead prices. Removed non working electricity day-ahead bidding zones."
  },
  "4.2.9": {
    "en": "Update to homey-api@1.5.30. Fix price lowest this_day trigger card. Catch various unhandled rejections."
  },
  "4.2.8": {
    "en": "Fix price lowest trigger cards. Catch various unhandled rejections."
  },
  "4.2.7": {
    "en": "Increased homey-api timeout. Catch various unhandled rejections."
  },
  "4.2.5": {
    "en": "Update to homey-api@1.5.28. Catch various unhandled rejections."
  },
  "4.2.4": {
    "en": "Update to homey-api@1.5.26."
  },
  "4.2.3": {
    "en": "Fixed wrong DAP prices just after midnight. Fixed DAP Gas prices timezone offset. Added DAP trigger flow card 'Avg price next [[hours]] becomes lowest for [[period]]'. DAP capability update before custom triggers. Update to homey-api@1.5.19."
  },
  "4.2.2": {
    "en": "Fixed Day Ahead Gas pricing from TTF market. Added trigger flow cards 'price becomes lowest for [[period]]'. Update to homey-api@1.5.18."
  },
  "4.2.1": {
    "en": "Added Day Ahead Gas pricing from TTF market. Added trigger flow cards 'Price above/below average'."
  },
  "4.2.0": {
    "en": "Fix Homey fw 7.4.0 compatibility. Added Day Ahead Gas pricing from TTF market. Update to homey-api@1.5.14."
  },
  "4.1.4": {
    "en": "fix price_changed flow trigger."
  },
  "4.1.3": {
    "en": "fix tariff via flow for gas and water."
  },
  "4.1.2": {
    "en": "DAP spread rate limited price fetch. DAP auto retry on price fetch failure. DAP buffer price info when API offline. Update to homey-api@1.5.11."
  },
  "4.1.1": {
    "en": "Fixed Send Tariff from Day-ahead pricing device."
  },
  "4.1.0": {
    "en": "Added Day-ahead 1 hour electricity pricing driver (All EU energy providers)"
  },
  "4.0.2": {
    "en": "Fix Watt source devices after homey reboot. Tariff and kWh meter 4 digits. Update to homey-api@1.5.8."
  },
  "4.0.1": {
    "en": "Added Power meter (Watt) as source device. Added Virtual Energy meter. Added more source apps. Added Cumulative Energy (kWh) and Power (Watt) as capability. Added flow to update power(kWh) gas(m3) water(m3). Added daily reset setting for Gas. Added poll and day_start settings for gas and water devices. Fixed water min/max reset via flow. Fix changing start date from settings. Fix weird values after settings change. Fix initial Money value after pairing. Fixed gas flow units. Set Watt_as_Source during pair. Many other fixes and improvements."
  },
  "4.0.0": {
    "en": "Added Power meter (Watt) as source device. Added Virtual Energy meter. Added more source apps. Added Cumulative Energy (kWh) and Power (Watt) as capability. Added flow to update power(kWh) gas(m3) water(m3). Added daily reset setting for Gas. Added poll and day_start settings for gas and water devices. Fixed water min/max reset via flow. Many other fixes and improvements."
  },
  "3.6.0": {
    "en": "Added previous hour/day/month/year money values. Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Added support for more source devices including P1 DSMRv4. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.5.1": {
    "en": "Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.5.0": {
    "en": "Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.4.1": {
    "en": "Added money values. Added dynamic tariff settings via flow. Added money flow triggers. Fixed tariff change from device settings. Improved device settings update. Small bugfixes and improvements."
  },
  "3.4.0": {
    "en": "Added money values. Added dynamic tariff settings via flow. Added money flow triggers. Improved device settings update. Small bugfixes and improvements."
  },
  "3.3.1": {
    "en": "Fix polling for homey-api. Update to homey-api@1.5.1"
  },
  "3.3.0": {
    "en": "Skip checking source device ready on restart. Replace athom-api with homey-api@1.5.0"
  },
  "3.2.0": {
    "en": "Fixed missing source watchdog. Faster recovery after source device available again. athom-api@3.7.1."
  },
  "3.1.0": {
    "en": "Fixed timezone offset. Changed driver/device icons."
  },
  "3.0.1": {
    "en": "Fixed advanced device settings. Fixed device polling mode."
  },
  "3.0.0": {
    "en": "Rewrite to SDK3. Update athom-api@3.6.7. Capabilities, Insights and flow cards are migrated. Status indicator added."
  },
  "2.7.0": {
    "en": "Fix monthly reset"
  },
  "2.6.0": {
    "en": "Added support to set start date of year."
  },
  "2.5.0": {
    "en": "Added support for Homewizard water app (has daily reset water meter)."
  },
  "2.4.1": {
    "en": "Fix hourly device restart. Improved watchdog."
  },
  "2.4.0": {
    "en": "Fix Daily reset production meters. Fix this day start settings. Increased app robustness. Added watchdog. Update athom-api@3.4.1"
  },
  "2.3.0": {
    "en": "Fix Homey boot issues. Update athom-api@3.3.0"
  },
  "2.2.1": {
    "en": "Update athom-api@3.2.14."
  },
  "2.2.0": {
    "en": "Added support for Tibber app. Added support for Homewizard energylink gas. Check for source device unavailable. Added polling mode for power (reduced system load in combination with Prometheus exporter). Removed deprecated meter driver. Update athom-api@3.2.13."
  },
  "2.1.1": {
    "en": "Added support for Solar Panels app. Update athom-api@3.2.7."
  },
  "2.1.0": {
    "en": "Added support for Solar Panels app. Update athom-api@3.2.7."
  },
  "2.0.1": {
    "en": "Added gas and water drivers. Added Sum per year (only for newly added devices). Upgrade athom-api@3.1.20."
  },
  "1.0.0": {
    "en": "Fix for monthly reset"
  },
  "0.2.0": {
    "en": "Bugfixes and added support for Open Toon"
  },
  "0.1.0": {
    "en": "First release"
  }
}
