{
  "4.4.9": {
    "en": "Updated Norwegian translation."
  },
  "4.4.8": {
    "en": "Added French translation. Updated Italian translation."
  },
  "4.4.7": {
    "en": "Added translations for German, Italian, Norwegian and Swedish. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.6": {
    "en": "Added translations for German, Italian, Norwegian and Swedish. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.5": {
    "en": "Added translations for German, Swedish and Italian. Added AND cards. Added weekend markup for DAP."
  },
  "4.4.4": {
    "en": "Added translations for German, Swedish and Italian"
  },
  "4.4.3": {
    "en": "Added DAP day/night markup (Grid cost in Norway). Fixed timezone offset for Estonia."
  },
  "4.4.2": {
    "en": "Added DAP day/night markup (Grid cost in Norway)."
  },
  "4.4.1": {
    "en": "Added automatic fetching of exchange rates. DAP markup is now in local currency. Fixed markup migration."
  },
  "4.4.0": {
    "en": "Added automatic fetching of exchange rates. Fixed DAP markup is now in local currency."
  },
  "4.3.7": {
    "en": "Fixed gas price fetching. Fix DAP send LEBA gas rate."
  },
  "4.3.6": {
    "en": "Set DAP markups and exchange rate via flow. Added DAP capabilities for hour of lowest price."
  },
  "4.3.5": {
    "en": "€ set as default currency for DAP. Configurable currency unit and decimals. homey-api@1.7.0"
  },
  "4.3.4": {
    "en": "Lowest price before time flow card extended to 12hrs. Added lowest number of hours this day. Update to homey-api@1.6.0"
  },
  "4.3.3": {
    "en": "Added highest price flow cards. Added lowest price before time flow card."
  },
  "4.3.2": {
    "en": "Removed insights DAP H1_7. Fixed Gas LEBA day-ahead prices timezone offset."
  },
  "4.3.0": {
    "en": "Added Gas LEBA day-ahead prices. Removed non working electricity day-ahead bidding zones."
  },
  "4.2.9": {
    "en": "Update to homey-api@1.5.30. Fix price lowest this_day trigger card. Catch various unhandled rejections."
  },
  "4.2.8": {
    "en": "Fix price lowest trigger cards. Catch various unhandled rejections."
  },
  "4.2.7": {
    "en": "Increased homey-api timeout. Catch various unhandled rejections."
  },
  "4.2.5": {
    "en": "Update to homey-api@1.5.28. Catch various unhandled rejections."
  },
  "4.2.4": {
    "en": "Update to homey-api@1.5.26."
  },
  "4.2.3": {
    "en": "Fixed wrong DAP prices just after midnight. Fixed DAP Gas prices timezone offset. Added DAP trigger flow card 'Avg price next [[hours]] becomes lowest for [[period]]'. DAP capability update before custom triggers. Update to homey-api@1.5.19."
  },
  "4.2.2": {
    "en": "Fixed Day Ahead Gas pricing from TTF market. Added trigger flow cards 'price becomes lowest for [[period]]'. Update to homey-api@1.5.18."
  },
  "4.2.1": {
    "en": "Added Day Ahead Gas pricing from TTF market. Added trigger flow cards 'Price above/below average'."
  },
  "4.2.0": {
    "en": "Fix Homey fw 7.4.0 compatibility. Added Day Ahead Gas pricing from TTF market. Update to homey-api@1.5.14."
  },
  "4.1.4": {
    "en": "fix price_changed flow trigger."
  },
  "4.1.3": {
    "en": "fix tariff via flow for gas and water."
  },  
  "4.1.2": {
    "en": "DAP spread rate limited price fetch. DAP auto retry on price fetch failure. DAP buffer price info when API offline. Update to homey-api@1.5.11."
  },
  "4.1.1": {
    "en": "Fixed Send Tariff from Day-ahead pricing device."
  },
  "4.1.0": {
    "en": "Added Day-ahead 1 hour electricity pricing driver (All EU energy providers)"
  },
  "4.0.2": {
    "en": "Fix Watt source devices after homey reboot. Tariff and kWh meter 4 digits. Update to homey-api@1.5.8."
  },
  "4.0.1": {
    "en": "Added Power meter (Watt) as source device. Added Virtual Energy meter. Added more source apps. Added Cumulative Energy (kWh) and Power (Watt) as capability. Added flow to update power(kWh) gas(m3) water(m3). Added daily reset setting for Gas. Added poll and day_start settings for gas and water devices. Fixed water min/max reset via flow. Fix changing start date from settings. Fix weird values after settings change. Fix initial Money value after pairing. Fixed gas flow units. Set Watt_as_Source during pair. Many other fixes and improvements."
  },
  "4.0.0": {
    "en": "Added Power meter (Watt) as source device. Added Virtual Energy meter. Added more source apps. Added Cumulative Energy (kWh) and Power (Watt) as capability. Added flow to update power(kWh) gas(m3) water(m3). Added daily reset setting for Gas. Added poll and day_start settings for gas and water devices. Fixed water min/max reset via flow. Many other fixes and improvements."
  },
  "3.6.0": {
    "en": "Added previous hour/day/month/year money values. Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Added support for more source devices including P1 DSMRv4. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.5.1": {
    "en": "Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.5.0": {
    "en": "Added min/max peak values. Added dynamic peak value reset via flow. Added min/max flow triggers. Fixed tariff change from flow sometimes not working. Fixed legacy migration failure. Small improvements."
  },
  "3.4.1": {
    "en": "Added money values. Added dynamic tariff settings via flow. Added money flow triggers. Fixed tariff change from device settings. Improved device settings update. Small bugfixes and improvements."
  },
  "3.4.0": {
    "en": "Added money values. Added dynamic tariff settings via flow. Added money flow triggers. Improved device settings update. Small bugfixes and improvements."
  },
  "3.3.1": {
    "en": "Fix polling for homey-api. Update to homey-api@1.5.1"
  },
  "3.3.0": {
    "en": "Skip checking source device ready on restart. Replace athom-api with homey-api@1.5.0"
  },
  "3.2.0": {
    "en": "Fixed missing source watchdog. Faster recovery after source device available again. athom-api@3.7.1."
  },
  "3.1.0": {
    "en": "Fixed timezone offset. Changed driver/device icons."
  },
  "3.0.1": {
    "en": "Fixed advanced device settings. Fixed device polling mode."
  },
  "3.0.0": {
    "en": "Rewrite to SDK3. Update athom-api@3.6.7. Capabilities, Insights and flow cards are migrated. Status indicator added."
  },
  "2.7.0": {
    "en": "Fix monthly reset"
  },
  "2.6.0": {
    "en": "Added support to set start date of year."
  },
  "2.5.0": {
    "en": "Added support for Homewizard water app (has daily reset water meter)."
  },
  "2.4.1": {
    "en": "Fix hourly device restart. Improved watchdog."
  },
  "2.4.0": {
    "en": "Fix Daily reset production meters. Fix this day start settings. Increased app robustness. Added watchdog. Update athom-api@3.4.1"
  },
  "2.3.0": {
    "en": "Fix Homey boot issues. Update athom-api@3.3.0"
  },
  "2.2.1": {
    "en": "Update athom-api@3.2.14."
  },
  "2.2.0": {
    "en": "Added support for Tibber app. Added support for Homewizard energylink gas. Check for source device unavailable. Added polling mode for power (reduced system load in combination with Prometheus exporter). Removed deprecated meter driver. Update athom-api@3.2.13."
  },
  "2.1.1": {
    "en": "Added support for Solar Panels app. Update athom-api@3.2.7."
  },
  "2.1.0": {
    "en": "Added support for Solar Panels app. Update athom-api@3.2.7."
  },
  "2.0.1": {
    "en": "Added gas and water drivers. Added Sum per year (only for newly added devices). Upgrade athom-api@3.1.20."
  },
  "1.0.0": {
    "en": "Fix for monthly reset"
  },
  "0.2.0": {
    "en": "Bugfixes and added support for Open Toon"
  },
  "0.1.0": {
    "en": "First release"
  }
}
